In [7]:
import pandas as pd
import numpy as np

In [3]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [4]:
dates = pd.date_range('20130101', periods = 6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [5]:
df2 = pd.DataFrame({'A': 1.,
                   'B': pd.Timestamp('20130102'), 
                   'C': pd.Series(1, index = list(range(4)), dtype = 'float32'), 
                   'D': np.array([3]*4, dtype = 'int32'),
                   'E': pd.Categorical(["test", "train", "test", "train"]), 
                   'F': 'foo'})
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [6]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [8]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01  2.171885 -1.100609  0.415417  2.172900
2013-01-02  0.971843 -0.185697 -0.236473  0.950549
2013-01-03 -1.773561  2.284956 -0.320023  0.895331
2013-01-04  0.805547  0.009988 -1.549855 -0.286101
2013-01-05 -0.068918  0.869294  0.193814 -1.153548
2013-01-06 -0.391934  1.293493  0.577785 -0.403339

In [10]:
df.head(2)

                   A         B         C         D
2013-01-01  2.171885 -1.100609  0.415417  2.172900
2013-01-02  0.971843 -0.185697 -0.236473  0.950549

In [11]:
df.tail(1)

                   A         B         C         D
2013-01-06 -0.391934  1.293493  0.577785 -0.403339

In [15]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [16]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [17]:
df.to_numpy()

array([[ 2.17188457, -1.10060904,  0.41541689,  2.17289971],
       [ 0.97184282, -0.18569711, -0.23647293,  0.95054895],
       [-1.77356143,  2.28495619, -0.32002332,  0.89533125],
       [ 0.80554682,  0.00998787, -1.54985522, -0.28610057],
       [-0.06891829,  0.86929448,  0.19381439, -1.15354825],
       [-0.39193385,  1.29349276,  0.57778461, -0.40333862]])

In [18]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [19]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.285810  0.528571 -0.153223  0.362632
std    1.350868  1.201617  0.769869  1.201070
min   -1.773561 -1.100609 -1.549855 -1.153548
25%   -0.311180 -0.136776 -0.299136 -0.374029
50%    0.368314  0.439641 -0.021329  0.304615
75%    0.930269  1.187443  0.360016  0.936745
max    2.171885  2.284956  0.577785  2.172900

In [20]:
df

                   A         B         C         D
2013-01-01  2.171885 -1.100609  0.415417  2.172900
2013-01-02  0.971843 -0.185697 -0.236473  0.950549
2013-01-03 -1.773561  2.284956 -0.320023  0.895331
2013-01-04  0.805547  0.009988 -1.549855 -0.286101
2013-01-05 -0.068918  0.869294  0.193814 -1.153548
2013-01-06 -0.391934  1.293493  0.577785 -0.403339

In [21]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    2.171885    0.971843   -1.773561    0.805547   -0.068918   -0.391934
B   -1.100609   -0.185697    2.284956    0.009988    0.869294    1.293493
C    0.415417   -0.236473   -0.320023   -1.549855    0.193814    0.577785
D    2.172900    0.950549    0.895331   -0.286101   -1.153548   -0.403339

In [22]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.285810  0.528571 -0.153223  0.362632
std    1.350868  1.201617  0.769869  1.201070
min   -1.773561 -1.100609 -1.549855 -1.153548
25%   -0.311180 -0.136776 -0.299136 -0.374029
50%    0.368314  0.439641 -0.021329  0.304615
75%    0.930269  1.187443  0.360016  0.936745
max    2.171885  2.284956  0.577785  2.172900

In [23]:
df3 = df.T

In [25]:
df3

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    2.171885    0.971843   -1.773561    0.805547   -0.068918   -0.391934
B   -1.100609   -0.185697    2.284956    0.009988    0.869294    1.293493
C    0.415417   -0.236473   -0.320023   -1.549855    0.193814    0.577785
D    2.172900    0.950549    0.895331   -0.286101   -1.153548   -0.403339

df3.describe()

In [28]:
df3.index

Index(['A', 'B', 'C', 'D'], dtype='object')

In [29]:
df3.describe()

       2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
count    4.000000    4.000000    4.000000    4.000000    4.000000    4.000000
mean     0.914898    0.375055    0.271676   -0.255105   -0.039839    0.269001
std      1.578431    0.677190    1.729677    0.978536    0.841093    0.823368
min     -1.100609   -0.236473   -1.773561   -1.549855   -1.153548   -0.403339
25%      0.036410   -0.198391   -0.683408   -0.602039   -0.340076   -0.394785
50%      1.293651    0.382426    0.287654   -0.138056    0.062448    0.092925
75%      2.172138    0.955872    1.242737    0.208878    0.362684    0.756712
max      2.172900    0.971843    2.284956    0.805547    0.869294    1.293493

In [30]:
df.sort_index(axis = 1, ascending = False)

                   D         C         B         A
2013-01-01  2.172900  0.415417 -1.100609  2.171885
2013-01-02  0.950549 -0.236473 -0.185697  0.971843
2013-01-03  0.895331 -0.320023  2.284956 -1.773561
2013-01-04 -0.286101 -1.549855  0.009988  0.805547
2013-01-05 -1.153548  0.193814  0.869294 -0.068918
2013-01-06 -0.403339  0.577785  1.293493 -0.391934

In [31]:
df

                   A         B         C         D
2013-01-01  2.171885 -1.100609  0.415417  2.172900
2013-01-02  0.971843 -0.185697 -0.236473  0.950549
2013-01-03 -1.773561  2.284956 -0.320023  0.895331
2013-01-04  0.805547  0.009988 -1.549855 -0.286101
2013-01-05 -0.068918  0.869294  0.193814 -1.153548
2013-01-06 -0.391934  1.293493  0.577785 -0.403339

In [33]:
df.sort_index(axis = 1, ascending = True)

                   A         B         C         D
2013-01-01  2.171885 -1.100609  0.415417  2.172900
2013-01-02  0.971843 -0.185697 -0.236473  0.950549
2013-01-03 -1.773561  2.284956 -0.320023  0.895331
2013-01-04  0.805547  0.009988 -1.549855 -0.286101
2013-01-05 -0.068918  0.869294  0.193814 -1.153548
2013-01-06 -0.391934  1.293493  0.577785 -0.403339

In [37]:
df.sort_values(by = 'C')

                   A         B         C         D
2013-01-04  0.805547  0.009988 -1.549855 -0.286101
2013-01-03 -1.773561  2.284956 -0.320023  0.895331
2013-01-02  0.971843 -0.185697 -0.236473  0.950549
2013-01-05 -0.068918  0.869294  0.193814 -1.153548
2013-01-01  2.171885 -1.100609  0.415417  2.172900
2013-01-06 -0.391934  1.293493  0.577785 -0.403339

In [38]:
df.A

2013-01-01    2.171885
2013-01-02    0.971843
2013-01-03   -1.773561
2013-01-04    0.805547
2013-01-05   -0.068918
2013-01-06   -0.391934
Freq: D, Name: A, dtype: float64

In [39]:
df['A']

2013-01-01    2.171885
2013-01-02    0.971843
2013-01-03   -1.773561
2013-01-04    0.805547
2013-01-05   -0.068918
2013-01-06   -0.391934
Freq: D, Name: A, dtype: float64

In [40]:
df[:3]

                   A         B         C         D
2013-01-01  2.171885 -1.100609  0.415417  2.172900
2013-01-02  0.971843 -0.185697 -0.236473  0.950549
2013-01-03 -1.773561  2.284956 -0.320023  0.895331

In [42]:
df['2013-01-01':'2013-01-05']

                   A         B         C         D
2013-01-01  2.171885 -1.100609  0.415417  2.172900
2013-01-02  0.971843 -0.185697 -0.236473  0.950549
2013-01-03 -1.773561  2.284956 -0.320023  0.895331
2013-01-04  0.805547  0.009988 -1.549855 -0.286101
2013-01-05 -0.068918  0.869294  0.193814 -1.153548

In [43]:
df.loc[dates[0]]

A    2.171885
B   -1.100609
C    0.415417
D    2.172900
Name: 2013-01-01 00:00:00, dtype: float64

In [45]:
df.loc[dates[1]]

A    0.971843
B   -0.185697
C   -0.236473
D    0.950549
Name: 2013-01-02 00:00:00, dtype: float64

In [49]:
for data in df: 
    print(data)

A
B
C
D

In [50]:
df.loc[:, ['A', 'B']]

                   A         B
2013-01-01  2.171885 -1.100609
2013-01-02  0.971843 -0.185697
2013-01-03 -1.773561  2.284956
2013-01-04  0.805547  0.009988
2013-01-05 -0.068918  0.869294
2013-01-06 -0.391934  1.293493

In [51]:
df.loc['2013-01-01':'2013-01-05', ['A', 'B']]

                   A         B
2013-01-01  2.171885 -1.100609
2013-01-02  0.971843 -0.185697
2013-01-03 -1.773561  2.284956
2013-01-04  0.805547  0.009988
2013-01-05 -0.068918  0.869294

In [52]:
df.loc[dates[0], 'A']

2.1718845717492465

In [53]:
df.at[dates[0], 'A']

2.1718845717492465

In [54]:
df

                   A         B         C         D
2013-01-01  2.171885 -1.100609  0.415417  2.172900
2013-01-02  0.971843 -0.185697 -0.236473  0.950549
2013-01-03 -1.773561  2.284956 -0.320023  0.895331
2013-01-04  0.805547  0.009988 -1.549855 -0.286101
2013-01-05 -0.068918  0.869294  0.193814 -1.153548
2013-01-06 -0.391934  1.293493  0.577785 -0.403339

In [55]:
df.iloc[3]

A    0.805547
B    0.009988
C   -1.549855
D   -0.286101
Name: 2013-01-04 00:00:00, dtype: float64

In [56]:
df.iloc[0]

A    2.171885
B   -1.100609
C    0.415417
D    2.172900
Name: 2013-01-01 00:00:00, dtype: float64

In [57]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04  0.805547  0.009988
2013-01-05 -0.068918  0.869294

In [58]:
df.iloc[:1, 0:2]

                   A         B
2013-01-01  2.171885 -1.100609

In [59]:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02  0.971843 -0.236473
2013-01-03 -1.773561 -0.320023
2013-01-05 -0.068918  0.193814

In [60]:
df.iloc[:, 1:3]

                   B         C
2013-01-01 -1.100609  0.415417
2013-01-02 -0.185697 -0.236473
2013-01-03  2.284956 -0.320023
2013-01-04  0.009988 -1.549855
2013-01-05  0.869294  0.193814
2013-01-06  1.293493  0.577785

In [61]:
df.iloc[1, 1]

-0.18569711476820724

In [62]:
df.iat[1, 1]

-0.18569711476820724

In [63]:
df[df.A > 0]

                   A         B         C         D
2013-01-01  2.171885 -1.100609  0.415417  2.172900
2013-01-02  0.971843 -0.185697 -0.236473  0.950549
2013-01-04  0.805547  0.009988 -1.549855 -0.286101

In [64]:
df[df > 0]

                   A         B         C         D
2013-01-01  2.171885       NaN  0.415417  2.172900
2013-01-02  0.971843       NaN       NaN  0.950549
2013-01-03       NaN  2.284956       NaN  0.895331
2013-01-04  0.805547  0.009988       NaN       NaN
2013-01-05       NaN  0.869294  0.193814       NaN
2013-01-06       NaN  1.293493  0.577785       NaN

In [67]:
df[df < 0]

                   A         B         C         D
2013-01-01       NaN -1.100609       NaN       NaN
2013-01-02       NaN -0.185697 -0.236473       NaN
2013-01-03 -1.773561       NaN -0.320023       NaN
2013-01-04       NaN       NaN -1.549855 -0.286101
2013-01-05 -0.068918       NaN       NaN -1.153548
2013-01-06 -0.391934       NaN       NaN -0.403339

In [68]:
df > 0

                A      B      C      D
2013-01-01   True  False   True   True
2013-01-02   True  False  False   True
2013-01-03  False   True  False   True
2013-01-04   True   True  False  False
2013-01-05  False   True   True  False
2013-01-06  False   True   True  False

In [69]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index = pd.date_range('20130102', periods = 6))

In [70]:
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [71]:
df['F'] = s1

In [72]:
df

                   A         B         C         D    F
2013-01-01  2.171885 -1.100609  0.415417  2.172900  NaN
2013-01-02  0.971843 -0.185697 -0.236473  0.950549  1.0
2013-01-03 -1.773561  2.284956 -0.320023  0.895331  2.0
2013-01-04  0.805547  0.009988 -1.549855 -0.286101  3.0
2013-01-05 -0.068918  0.869294  0.193814 -1.153548  4.0
2013-01-06 -0.391934  1.293493  0.577785 -0.403339  5.0

In [73]:
df.at[dates[0], 'A'] = 0

In [74]:
df

                   A         B         C         D    F
2013-01-01  0.000000 -1.100609  0.415417  2.172900  NaN
2013-01-02  0.971843 -0.185697 -0.236473  0.950549  1.0
2013-01-03 -1.773561  2.284956 -0.320023  0.895331  2.0
2013-01-04  0.805547  0.009988 -1.549855 -0.286101  3.0
2013-01-05 -0.068918  0.869294  0.193814 -1.153548  4.0
2013-01-06 -0.391934  1.293493  0.577785 -0.403339  5.0

In [75]:
df.iat[0, 1] = 0

In [76]:
df

                   A         B         C         D    F
2013-01-01  0.000000  0.000000  0.415417  2.172900  NaN
2013-01-02  0.971843 -0.185697 -0.236473  0.950549  1.0
2013-01-03 -1.773561  2.284956 -0.320023  0.895331  2.0
2013-01-04  0.805547  0.009988 -1.549855 -0.286101  3.0
2013-01-05 -0.068918  0.869294  0.193814 -1.153548  4.0
2013-01-06 -0.391934  1.293493  0.577785 -0.403339  5.0

In [78]:
df.loc[:, 'D'] = np.array([5] * len(df))

In [79]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000  0.415417  5  NaN
2013-01-02  0.971843 -0.185697 -0.236473  5  1.0
2013-01-03 -1.773561  2.284956 -0.320023  5  2.0
2013-01-04  0.805547  0.009988 -1.549855  5  3.0
2013-01-05 -0.068918  0.869294  0.193814  5  4.0
2013-01-06 -0.391934  1.293493  0.577785  5  5.0

In [80]:
df2 = df.copy()

In [81]:
df2[df2 > 0] = -df2

In [82]:
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.415417 -5  NaN
2013-01-02 -0.971843 -0.185697 -0.236473 -5 -1.0
2013-01-03 -1.773561 -2.284956 -0.320023 -5 -2.0
2013-01-04 -0.805547 -0.009988 -1.549855 -5 -3.0
2013-01-05 -0.068918 -0.869294 -0.193814 -5 -4.0
2013-01-06 -0.391934 -1.293493 -0.577785 -5 -5.0

In [84]:
df1 = df.reindex(index = dates[0:4], columns = list(df.columns) + ['E'])

In [85]:
df1

                   A         B         C  D    F   E
2013-01-01  0.000000  0.000000  0.415417  5  NaN NaN
2013-01-02  0.971843 -0.185697 -0.236473  5  1.0 NaN
2013-01-03 -1.773561  2.284956 -0.320023  5  2.0 NaN
2013-01-04  0.805547  0.009988 -1.549855  5  3.0 NaN

In [86]:
df1.loc[dates[0]:dates[1], 'E'] = 1

In [87]:
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  0.415417  5  NaN  1.0
2013-01-02  0.971843 -0.185697 -0.236473  5  1.0  1.0
2013-01-03 -1.773561  2.284956 -0.320023  5  2.0  NaN
2013-01-04  0.805547  0.009988 -1.549855  5  3.0  NaN

In [88]:
df1.dropna(how = 'any')

                   A         B         C  D    F    E
2013-01-02  0.971843 -0.185697 -0.236473  5  1.0  1.0

In [89]:
df1.fillna(value = 5)

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  0.415417  5  5.0  1.0
2013-01-02  0.971843 -0.185697 -0.236473  5  1.0  1.0
2013-01-03 -1.773561  2.284956 -0.320023  5  2.0  5.0
2013-01-04  0.805547  0.009988 -1.549855  5  3.0  5.0

In [90]:
pd.isna(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

In [91]:
df.describe()

              A         B         C    D         F
count  6.000000  6.000000  6.000000  6.0  5.000000
mean  -0.076171  0.712006 -0.153223  5.0  3.000000
std    0.986150  0.963607  0.769869  0.0  1.581139
min   -1.773561 -0.185697 -1.549855  5.0  1.000000
25%   -0.311180  0.002497 -0.299136  5.0  2.000000
50%   -0.034459  0.439641 -0.021329  5.0  3.000000
75%    0.604160  1.187443  0.360016  5.0  4.000000
max    0.971843  2.284956  0.577785  5.0  5.000000

In [92]:
df.mean()

A   -0.076171
B    0.712006
C   -0.153223
D    5.000000
F    3.000000
dtype: float64

In [93]:
df.mean(1)

2013-01-01    1.353854
2013-01-02    1.309935
2013-01-03    1.438274
2013-01-04    1.453136
2013-01-05    1.998838
2013-01-06    2.295869
Freq: D, dtype: float64

In [95]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index = dates).shift(2)

In [96]:
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [97]:
df.sub(s, axis = 'index')

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03 -2.773561  1.284956 -1.320023  4.0  1.0
2013-01-04 -2.194453 -2.990012 -4.549855  2.0  0.0
2013-01-05 -5.068918 -4.130706 -4.806186  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

In [98]:
df.apply(np.cumsum)

                   A         B         C   D     F
2013-01-01  0.000000  0.000000  0.415417   5   NaN
2013-01-02  0.971843 -0.185697  0.178944  10   1.0
2013-01-03 -0.801719  2.099259 -0.141079  15   3.0
2013-01-04  0.003828  2.109247 -1.690935  20   6.0
2013-01-05 -0.065090  2.978541 -1.497120  25  10.0
2013-01-06 -0.457024  4.272034 -0.919336  30  15.0

In [99]:
df.apply(lambda x : x.max() - x.min())

A    2.745404
B    2.470653
C    2.127640
D    0.000000
F    4.000000
dtype: float64

In [103]:
s = pd.Series(np.random.randint(0, 7, size = 10))
s

0    0
1    5
2    0
3    1
4    1
5    6
6    6
7    3
8    6
9    2
dtype: int64

In [104]:
s.value_counts()

6    3
1    2
0    2
5    1
3    1
2    1
dtype: int64

In [110]:
df['A'].value_counts()

-0.391934    1
-0.068918    1
 0.805547    1
-1.773561    1
 0.971843    1
 0.000000    1
Name: A, dtype: int64

In [111]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [112]:
s.str

In [113]:
# 合并

In [114]:
df = pd.DataFrame(np.random.randn(10, 4))

In [115]:
df

          0         1         2         3
0  0.670057  0.070439  1.458907  0.416509
1 -2.034094 -0.750267  0.923935  0.258171
2 -0.116688  1.282682 -0.321829 -1.325629
3 -0.054882 -0.887123 -1.500746 -0.682271
4  1.687771 -2.426852  1.187588 -0.322692
5  0.691750 -0.122772  0.064829 -1.737910
6 -0.095804  0.987019 -0.236964  0.169293
7  0.161824 -2.431965 -1.435164  0.087953
8 -0.102374  0.686056 -0.450402 -1.367715
9 -0.088902  0.708617  0.751040  0.261714

In [117]:
pieces = [df[:3], df[3:7], df[7: ]]

In [118]:
pieces

[          0         1         2         3
 0  0.670057  0.070439  1.458907  0.416509
 1 -2.034094 -0.750267  0.923935  0.258171
 2 -0.116688  1.282682 -0.321829 -1.325629,
           0         1         2         3
 3 -0.054882 -0.887123 -1.500746 -0.682271
 4  1.687771 -2.426852  1.187588 -0.322692
 5  0.691750 -0.122772  0.064829 -1.737910
 6 -0.095804  0.987019 -0.236964  0.169293,
           0         1         2         3
 7  0.161824 -2.431965 -1.435164  0.087953
 8 -0.102374  0.686056 -0.450402 -1.367715
 9 -0.088902  0.708617  0.751040  0.261714]

In [119]:
pd.concat(pieces)

          0         1         2         3
0  0.670057  0.070439  1.458907  0.416509
1 -2.034094 -0.750267  0.923935  0.258171
2 -0.116688  1.282682 -0.321829 -1.325629
3 -0.054882 -0.887123 -1.500746 -0.682271
4  1.687771 -2.426852  1.187588 -0.322692
5  0.691750 -0.122772  0.064829 -1.737910
6 -0.095804  0.987019 -0.236964  0.169293
7  0.161824 -2.431965 -1.435164  0.087953
8 -0.102374  0.686056 -0.450402 -1.367715
9 -0.088902  0.708617  0.751040  0.261714

In [120]:
# 连接

In [125]:
left = pd.DataFrame({'key': ['foo', 'bar'], 'lval':[1, 2]})
right = pd.DataFrame({'key': ['foo', 'bar'], 'rval': [4, 5]})

In [126]:
left

   key  lval
0  foo     1
1  bar     2

In [127]:
right

   key  rval
0  foo     4
1  bar     5

In [128]:
pd.merge(left, right, on = 'key')

   key  lval  rval
0  foo     1     4
1  bar     2     5

In [130]:
df = pd.DataFrame(np.random.randn(8, 4), columns = ['A', 'B', 'C', 'D'])

In [131]:
df

          A         B         C         D
0 -0.346903  0.629695  1.090124  0.121494
1  0.371056 -0.836154  0.251527  0.544644
2  1.038677  0.198542 -0.706680  0.621571
3  1.054388 -1.911023 -1.686932  0.191097
4 -0.237320  2.329428  0.871674  0.888837
5  2.571871 -0.385855 -0.041821  0.110554
6 -0.021348  0.089570  0.320436 -0.969856
7 -2.099218 -0.130894 -0.247452 -0.076493

In [132]:
s = df.iloc[3]

In [133]:
s

A    1.054388
B   -1.911023
C   -1.686932
D    0.191097
Name: 3, dtype: float64

In [134]:
df.append(s, ignore_index = True)

          A         B         C         D
0 -0.346903  0.629695  1.090124  0.121494
1  0.371056 -0.836154  0.251527  0.544644
2  1.038677  0.198542 -0.706680  0.621571
3  1.054388 -1.911023 -1.686932  0.191097
4 -0.237320  2.329428  0.871674  0.888837
5  2.571871 -0.385855 -0.041821  0.110554
6 -0.021348  0.089570  0.320436 -0.969856
7 -2.099218 -0.130894 -0.247452 -0.076493
8  1.054388 -1.911023 -1.686932  0.191097

In [135]:
df.A

0   -0.346903
1    0.371056
2    1.038677
3    1.054388
4   -0.237320
5    2.571871
6   -0.021348
7   -2.099218
Name: A, dtype: float64

In [138]:
df.cov()

          A         B         C         D
A  1.835330 -0.514986 -0.365126  0.120640
B -0.514986  1.483906  0.809573  0.190467
C -0.365126  0.809573  0.788496  0.001830
D  0.120640  0.190467  0.001830  0.318102

In [137]:
df.loc[3]

A    1.054388
B   -1.911023
C   -1.686932
D    0.191097
Name: 3, dtype: float64

In [139]:
df.std()

A    1.354743
B    1.218157
C    0.887973
D    0.564006
dtype: float64

In [140]:
# 分组

In [141]:
df = pd.DataFrame({'A': ['foo', 'bar', 'foo', 'bar', 'foo', 'bar', 'foo', 'bar'], 
                  'B': ['one', 'one', 'two', 'three', 'two', 'two', 'one', 'three'], 
                  'C': np.random.randn(8), 
                  'D': np.random.randn(8)})

In [142]:
df

     A      B         C         D
0  foo    one -0.551672 -0.640045
1  bar    one  0.638242 -0.608010
2  foo    two  0.771939  1.005459
3  bar  three  0.983930  0.007634
4  foo    two -1.222865 -1.486348
5  bar    two -2.496897  1.894292
6  foo    one -0.836167 -0.500711
7  bar  three -0.959669 -2.151888

In [143]:
df.groupby('A').sum()

            C         D
A
bar -1.834394 -0.857972
foo -1.838765 -1.621645

In [144]:
df.groupby('B').sum()

              C         D
B
one   -0.749597 -1.748766
three  0.024261 -2.144254
two   -2.947823  1.413403

In [147]:
a = []
a[5] = 'b'
print(a)

IndexError: list assignment index out of range